In [16]:
"pandas对象拥有一组常用的数学和统计方法"
"""它们大部分都属于约简和汇总统计，用于从Series中提取的个值
（如sum或mean)或从DataFrame的行或列中提取一个Series。跟对应的
NumPy数组方法相比，它们都是基于没有缺失数据的假设而构建的"""
"接下来看一 个简单的DataFrame"
import numpy as np
import pandas as pd
from pandas import Series, DataFrame
df = DataFrame([[1.4, np.nan], [7.1, -4.5],  [np.nan, np.nan],
                [0.75,-1.3]],index=['a','b','c','d'],
               columns=[ 'one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [2]:
"调用 DataFrame的 sum 方法将会返回一个含有列小计的 Series"
df.sum() #df.sum(axis=0)

one    9.25
two   -5.80
dtype: float64

In [3]:
df.sum(axis=1) #传入axis=1将会按行进行求和运算

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [4]:
"""NA值会自动被排除，除非整个切片（这里指的是行或列）都是NA。
通过 skipna 选项可 以禁用该功能"""
"""
约简方法的选项 
选项      说明
axis    约简的轴。DataFrame的行用0，列用1
skipna  排除缺失值，默认值为True
level   如果轴是层次化索引的（即Multiindex)，则根据level分组约简
"""
df.mean(axis=1, skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [5]:
"""有些方法（如idxmin和idxmax)返回的是间接统计（比如达到最小值或
最大值的索引）"""
df.idxmax()

one    b
two    d
dtype: object

In [6]:
df.cumsum() # 累计型的计算

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [7]:
""" 还有一种方法，它既不是约简型也不是累计型。describe就是一个例
子，它用于一次性 产生多个汇总统计"""
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [8]:
"对于非数值型数据，describe会产生另外一种汇总统计"
obj = Series(['a','a','b','c'] * 4)
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [9]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [12]:
t="""
描述和汇总统计:
方法                 说明
count                非NA值的数量
describe             针对Series或各DataFrame列计算汇总统计
min,max              计算最小值和最大值
argmin,argmax        计算能够获取到最小值和最大值的索引位置（整数)
idxmin,idxmax        计算能够获取到最小值和最大值的索引值
quantile             计算样本的分位数（0到 1）
sum                  值的总和
mean                 值的平均数
media                值的算术中位数（50%分位数)
mad                  根据平均值计算平均绝对离差
var                  样本值的方差
std                  样本值的标准差
skew                 样本值的偏度（三阶矩）
kurt                 样本值的峰度（四阶矩）
cumsum               样本值的累计和
cummin,cummax        样本值的累计最大值和累计最小
cumprod              样本值的累计积
diff                 计算一阶差分（对时间序列很有用)
pct_change           计算百分数变化
"""
"有些汇总统计（如相关系数和协方差）是通过参数对计算出来的"
"下面几个DataFrame数据来自Yahoo! Finance的股票价格和成交量"
import pandas_datareader.data as web
all_data = {}
for ticker in ['AAPL','IBM','MSFT','GOOG']:
    all_data[ticker] = web.get_data_yahoo(ticker ,'1/1/2000','1/1/2010')
price = DataFrame({tic: data['Adj Close'] for tic,data in all_data.iteritems()})
volume = DataFrame({tic: data['Volume'] for tic,data in all_data.iteritems()})
"接下来计算价格的百分数变化"
returns = price.pct_change()
returns.tail()

ImmediateDeprecationError:
Yahoo Actions has been immediately deprecated due to large breaks in the API without the
introduction of a stable replacement. Pull Requests to re-enable these data
connectors are welcome.

See https://github.com/pydata/pandas-datareader/issues

In [ ]:
"""Series的 corr 方法用于计算两个Series中重叠的、非NA的、按索引对
齐的值的相关系 数。与此类似，cov 用干计算协方差"""
returns.MSFT.corr(returns.IBM)
returns.MSFT.cov(returns.IBM)

In [ ]:
"""DataFrame的corr和cov方法将以DataFrame的形式返回完整的相关系
数或协方差矩阵"""
returns.corr()
returns.cov()

In [ ]:
"""利用DataFrame的 corrwith 方法，可以计算其列或行跟另一个Series或
DataFrame之间的相关系数。传入一个Series将会返回一个相关系数值
Series (针对各列进行计算）"""
returns.corrwith(returns.IBM)

In [ ]:
"""传入一个DataFrame则会计算按列名配对的相关系数。下面计算了百
分比变化与成交量的相关系数"""
"""传入axis=1即可按行进行计算。无论如何，在计算相关系数之前，所
有的数据项都会按标签对齐。"""
returns.corrwith(volume)

In [13]:
"唯一值、值计数以及成员资格"
"还有一类方法可以从一维Series的值中抽取信息。以下面这个Series为例"
obj=Series(['c','a','d','a','a','b','b','c','c'])
"函数是unique，它可以得到Series中的唯一值数组"
uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [14]:
"""返回的唯一值是未排序的，如果需要的话，可以对结果再次进行排序
(uniques. sort())。value_counts用于计算一个Series中各值出现的频率"""
obj.value_counts()   #pd.value_counts(obj.values, sort=True)

a    3
c    3
b    2
d    1
dtype: int64

In [17]:
"""为了便于査看，结果Series是按值频率降序排列的。value_counts还是
一个顶级pandas方法，可用于任何数组或序列"""
"由于没有排序，是随机排序的，因此每次运行结果都不一样"
pd.value_counts(obj.values, sort=False)

b    2
c    3
a    3
d    1
dtype: int64

In [18]:
"""最后是 isin，它用于判断矢量化集合的成员资格，可用于选取Series中
或 DataFrame列中 数据的子集"""
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [20]:
mask=obj.isin(['b','c'])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [21]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [22]:
t="""
唯一值、值计数、成员资格方法
方法            说明
isin            计算一个表示“Series各值是否包含于
                传入的值序列中”的布尔型数组 
unique          计算Series中的唯一值数组，按发现的顺序返回 
value_counts    返回一个Series, 其索引为唯一值，其值为频率，
                按计数值降序排列
"""
"有时，可能希望得到DataFrame中多个相关列的一张柱状图"
data = DataFrame({'Qu1': [1, 3, 4, 3, 4], 'Qu2': [2, 3, 1, 2, 3],
                  'Qu3': [1, 5, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [23]:
"将 pandas.value_counts 传给该 DataFrame 的 apply 函数，就会出现"
result = data.apply(pd.value_counts).fillna(0)
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [24]:
"""缺失数据（missing data)在大部分数据分析应用中都很常见。pandas的
设计目标之一就是让缺失数据的处理任务尽量轻松。例如，pandas对象
上的所有描述统计都排除了缺失数据"""
""" pandas使用浮点值NaN (Not a Number)表示浮点和非浮点数组中的缺
失数据。它只是一 个便于被检测出来的标记而已"""
string_data=Series(['aardvark','artichoke',np.nan,'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [25]:
string_data.isnull()  # notnull()

0    False
1    False
2     True
3    False
dtype: bool

In [27]:
"Python内置的None值也会被当做NA处理"
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [28]:
t="""
NA处理方法:
方法                      说明
dropna       根据各标签的值中是否存在缺失数据对轴标签进行过滤，
             可通过阈值调节对缺失值的容忍度
fillna       用指定值或插值方法（如ffill或bfill)填充缺失数据
isnull       返回一个含有布尔值的对象，这些布尔值表示
             哪些值是缺失值/NA，该对象的类型与源类型一样
notnull      isnull 的否定式
"""

In [29]:
"滤除缺失数据"
"""过滤掉缺失数据的办法有很多种。纯手工操作永远都是一个办法，但
dropna可能会更实 用一些。对于一个Series，dropna返回一个仅含非空数
据和索引值的Series
"""
from numpy import nan as NA
data = Series([1, NA, 3.5, NA, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [30]:
"也可以通过布尔型索引达到这个目的"
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [31]:
"对于DataFrame对象，dropna 默认丢弃任何含有缺失值的行"
data = DataFrame([[1., 6.5, 3.],[1., NA,NA],
                  [NA, NA, NA], [NA, 6.5, 3.1]])
cleaned = data.dropna()
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.1

In [32]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [35]:
"传入 how='all'将只丢弃全为 NA的那些行"
data.dropna(how="all") #要用这种方式丢弃列，只需传入axis=1即可

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.1

In [36]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.1 NaN

In [38]:
data.dropna(axis=1, how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.1

In [41]:
"""另一个滤除 DataFramc行 的问题涉及时间序列数据。假设只想留下一
部分观测数据，可以用thresh参数实现此目的"""
df = DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df

          0         1         2
0  1.018329       NaN       NaN
1  0.830963       NaN       NaN
2 -1.289964       NaN  0.332058
3 -1.268187       NaN  0.952248
4  0.363121  1.119900  0.203763
5  2.146046 -0.957133 -1.110464
6 -1.119825  0.580343 -0.674303

In [42]:
df.dropna(thresh=3)

          0         1         2
4  0.363121  1.119900  0.203763
5  2.146046 -0.957133 -1.110464
6 -1.119825  0.580343 -0.674303

In [43]:
"填充缺失数据"
"""若不想滤除缺失数据（有可能会丢弃跟它有关的其他数据），而是希望
通过其他方式填补那些“空洞”。对于大多数情况而言，fillna 方法是最
主要的函数。通过一个常数调用fillna就会将缺失值替换为那个常数值"""
df.fillna(0)

          0         1         2
0  1.018329  0.000000  0.000000
1  0.830963  0.000000  0.000000
2 -1.289964  0.000000  0.332058
3 -1.268187  0.000000  0.952248
4  0.363121  1.119900  0.203763
5  2.146046 -0.957133 -1.110464
6 -1.119825  0.580343 -0.674303

In [44]:
"若是通过一个字典调用fillna(), 就可以实现对不同的列填充不同的值"
df.fillna({1:0.5, 3: -1})

          0         1         2
0  1.018329  0.500000       NaN
1  0.830963  0.500000       NaN
2 -1.289964  0.500000  0.332058
3 -1.268187  0.500000  0.952248
4  0.363121  1.119900  0.203763
5  2.146046 -0.957133 -1.110464
6 -1.119825  0.580343 -0.674303

In [45]:
" fillna()默认会返回新对象，但也可以对现有对象进行就地修改"
#总是返回被填允对象的引用
_ = df.fillna(0, inplace=True)
df

          0         1         2
0  1.018329  0.000000  0.000000
1  0.830963  0.000000  0.000000
2 -1.289964  0.000000  0.332058
3 -1.268187  0.000000  0.952248
4  0.363121  1.119900  0.203763
5  2.146046 -0.957133 -1.110464
6 -1.119825  0.580343 -0.674303

In [47]:
"对 reindex 有效的那些插值方法也可用于 fillna()"
df = DataFrame(np.random.randn(6, 3))
df.iloc[2:,1] = NA
df.iloc[4:,2] = NA
df

          0         1         2
0  0.489710 -0.778730 -0.968411
1 -2.379352 -0.306327  1.136542
2  0.758395       NaN -1.757194
3 -0.856006       NaN  0.618311
4 -0.102998       NaN       NaN
5 -0.345404       NaN       NaN

In [50]:
df.fillna(method='ffill')

          0         1         2
0  0.489710 -0.778730 -0.968411
1 -2.379352 -0.306327  1.136542
2  0.758395 -0.306327 -1.757194
3 -0.856006 -0.306327  0.618311
4 -0.102998 -0.306327  0.618311
5 -0.345404 -0.306327  0.618311

In [51]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  0.489710 -0.778730 -0.968411
1 -2.379352 -0.306327  1.136542
2  0.758395 -0.306327 -1.757194
3 -0.856006 -0.306327  0.618311
4 -0.102998       NaN  0.618311
5 -0.345404       NaN  0.618311

In [52]:
" 可以利用 fillna 实现许多别的功能。比如可以传入Series 的平均值或中位数"
data = Series([1., NA, 3.5, NA, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [53]:
t="""
fillna函数的参数
参数                   说明
value     用于填充缺失值的标量值或字典对象
method    插值方式。如果函数调用时未指定其他参数的话，默认为ffill
axis      待填充的轴，默认axis=0
inplace   修改调用者对象而不产生副本
limit     (对于前向和后向填充)可以连续填充的最大数量
"""

In [54]:
"层次化索引"
"""层次化索引（hierarchical indexing)是pandas的一项重要功能，
它能在一个轴上拥 有多个（两个以上）索引级别。抽象点说，
它使能以低维度形式处理高维度数据。 先来看一个简单的例子"""
"创建一个Series，并用一个由列表或数组组成的列表作为索引"
data = Series(np.random.randn(10), index=[['a','a','a','b','b','b','c','c','d','d'],
                                          [1, 2, 3, 1, 2, 3, 1, 2, 2, 3]])
data

a  1    0.431216
   2   -0.517871
   3   -0.611499
b  1   -0.751420
   2   -0.755225
   3    1.566955
c  1   -0.232813
   2    0.969716
d  2    0.917264
   3   -1.017973
dtype: float64

In [55]:
"""这就是带有Multilndex索引的Series的格式化输出形式。
索引之间的“间隔”表示“直接使用上面的标签”"""
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [56]:
" 对于一个层次化索引的对象，选取数据子集的操作"
data["b"]

1   -0.751420
2   -0.755225
3    1.566955
dtype: float64

In [57]:
data["b":"c"]

b  1   -0.751420
   2   -0.755225
   3    1.566955
c  1   -0.232813
   2    0.969716
dtype: float64

In [59]:
data.loc[["b", "d"]]

b  1   -0.751420
   2   -0.755225
   3    1.566955
d  2    0.917264
   3   -1.017973
dtype: float64

In [60]:
"有时甚至还可以在“内层”中进行选取"
data

a  1    0.431216
   2   -0.517871
   3   -0.611499
b  1   -0.751420
   2   -0.755225
   3    1.566955
c  1   -0.232813
   2    0.969716
d  2    0.917264
   3   -1.017973
dtype: float64

In [61]:
data[:, 2]

a   -0.517871
b   -0.755225
c    0.969716
d    0.917264
dtype: float64

In [62]:
"""层次化索引在数据重塑和基于分组的操作（如透视表生成）中扮演着
重要的角色。可通过其 unstack 方法被重新安排到一个 DataFrame 中"""
data.unstack()

          1         2         3
a  0.431216 -0.517871 -0.611499
b -0.751420 -0.755225  1.566955
c -0.232813  0.969716       NaN
d       NaN  0.917264 -1.017973

In [63]:
"unstack的逆运览是stack:"
data.unstack().stack()

a  1    0.431216
   2   -0.517871
   3   -0.611499
b  1   -0.751420
   2   -0.755225
   3    1.566955
c  1   -0.232813
   2    0.969716
d  2    0.917264
   3   -1.017973
dtype: float64

In [64]:
" 对于一个DataFrame，每条轴都可以有分层索引"
frame = DataFrame(np.arange(12).reshape((4, 3)),
                  index=[['a','a','b','b'], [1, 2, 1, 2]], 
                  columns=[['Ohio','Ohio','Colorado'],['Green','Red','Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [66]:
"""各层都可以有名字（可以是字符串，也可以是別的Python对象）。如
果指定了名称，它 们就会显示在控制台输出中（不要将索引名称跟轴标
签混为一谈！）"""
frame.index.names = ["key1","key2"]
frame.columns.names = ['state', 'color']
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [67]:
"由于有了分部的列索引，因此可以轻松选取列分组"
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [70]:
"""可以单独创建Multilndex然后复用。上面那个DataFrame中的（分级
的）列可以这样创建"""
pd.MultiIndex.from_arrays([['Ohio', 'Ohio', 'Colorado'],
                        ['Green','Red', 'Green']],
                       names=['state', 'color'])

MultiIndex(levels=[['Colorado', 'Ohio'], ['Green', 'Red']],
           labels=[[1, 1, 0], [0, 1, 0]],
           names=['state', 'color'])

In [73]:
"重排分级顺序"
""" 如需要重新调整某条轴上各级别的顺序，或根据指定级别上的值
对数据进行排序。swaplevel 接受两个级别编号或名称，并返回一
个互换了级别的新对象（但数据不会发生变化）"""
frame
frame.swaplevel('key1','key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [75]:
"""而sortlevel则根据单个级别中的值对数据进行排序（稳定的）。交换级
別时，常常也会 用到sortlevel，这样最终结果就是有序的了"""
# frame.sortlevel(1) # sortlevel is deprecated, use sort_index(level= ...)
frame.sort_index(level=1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [78]:
"""注意：在层次化索引的对象上，如果索引是按字典方式从外到内排序（即
调用sortlevel(0)或sort_index()的结果），数据选取操作的性能要好很多"""
frame.swaplevel(0,1).sort_index(level=0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

In [79]:
"根据级别汇总统计"
"""许多对DataFrame和Series的描述和汇总统计都有一个level选项，它用
于指定在某条轴 上求和的级别。"""
"""再以上面那个DataFrame为例，可以根据行或列上的级別来进行求和，
如下所示"""

frame.sum(level='key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [80]:
frame.sum(level='color',axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

In [81]:
"使用DataFrame的列"
"""人们经常想要将DataFrame的一个或多个列当做行索引来用，或者可能
希望将行索引变成DataFrame的列。以下面这个DataFrame为例"""
frame = DataFrame({'a': range(7),
                   'b': range(7, 0, -1),
                   'c': ['one','one','one','two','two','two', 'two'],
                   'd': [0, 1, 2, 0, 1, 2, 3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [83]:
"""DataFrame的set_index函数会将其一个或多个列转换为行索引，创建
一个新的 DataFrame"""
frame2 = frame.set_index(['c', 'd'])
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [84]:
"默认情况下，那些列会从DataFrame中移除，但也可以将其保留下来"
frame.set_index(['c','d'], drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [85]:
"reset_index的功能跟set_index刚好相反，层次化索引的级别会被转移到列里面"
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

In [91]:
"整数索引"
"""操作由整数索引的pandas对象跟内置的Python数据结构 (如列表和元组)
在索引语义上有些不同。例如，你可能认为下面这段代码不会产生一个错误
"""
"""这里，有一个含有0,1,2的索引，很难推断出用户想要什么(基于标签
或位置的索引)"""
ser = Series(np.arange(3.))
ser
# ser[-1]

0    0.0
1    1.0
2    2.0
dtype: float64

In [89]:
"一个非整数索引，就没有这样的歧义"
ser2 = Series(np.arange(3.), index=['a', 'b', 'c'])
ser2[-1]

2.0

In [93]:
"""为了保持良好的一致性，如果轴索引含有索引器，那么根据整数进
行数据选取的操作将总是面向标签的。这也包括用iloc进行切片"""
ser.iloc[:1]

0    0.0
dtype: float64

In [95]:
"""如果你需要可靠的、不考虑索引类型的、基于位置的索引，可以
使用Series的iget_ value 方法和 DataFrame 的 irow 和 icol 方法"""
ser3 = Series(range(3), index=[-5, 1, 3])
#ser3.iget_value(2) # 'Series' object has no attribute 'iget_value'

In [97]:
frame = DataFrame(np.arange(6).reshape(3, 2), index=[2,0,1])
#frame.irow(0) # 'DataFrame' object has no attribute 'irow'

In [100]:
"面板数据"
""" pandas有一个Panel数据结构，可以将其看做一个三维版的可以
用一个由DataFrame对象组成的字典或一个三维ndarray来创建Panel对象"""
import pandas_datareader.data as web
#pdata = pd.Panel(dict((stk, web.get_data_yahoo(stk, "1/1/2009","6/1/2012"))
#        for stk in ["AAPL","GOOG","MSFT","DELL"]))